app/controllers/teams_controller.rb

SELECT  "teams".* FROM "teams" WHERE "teams"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
  def show

    @team = Team.find_by(user_id: params[:id])